/*
 * @Author: mangwu                                                             *
 * @File: 1.js                                                                 *
 * @Date: 2023-03-23 18:25:35                                                  *
 * @LastModifiedDate: 2023-03-23 18:25:55                                      *
 * @ModifiedBy: mangwu                                                         *
 * -----------------------                                                     *
 * Copyright (c) 2023 mangwu                                                   *
 * -----------------------                                                     *
 * @HISTORY:                                                                   *
 * Date   	            By 	    Comments                                       *
 * ---------------------	--------	----------------------------------------------- *
 */


// 给你两个字符串s和 goal，只要我们可以通过交换 s中的两个字母得到与 goal相等的结果，就返
// 回 true; 否则返回 false
// 交换字母的定义是:取两个下标i和j(下标从0开始)且满足i!=j，接着交换s和s处的
// 字符
// 例如，在“abcd”中交换下标0和下标 2的元素可以生成 “cbadl
