/*
 * @Author: mangwu                                                             *
 * @File: main.js                                                              *
 * @Date: 2024-04-28 09:49:38                                                  *
 * @LastModifiedDate: 2024-04-29 16:29:53                                      *
 * @ModifiedBy: mangwu                                                         *
 * -----------------------                                                     *
 * Copyright (c) 2024 mangwu                                                   *
 * -----------------------                                                     *
 * @HISTORY:                                                                   *
 * Date   	            By 	    Comments                                       *
 * ---------------------	--------	----------------------------------------------- *
 */

// 给你一个整数 n ，以二进制字符串的形式返回该整数的 负二进制（base -2）表示。

// 注意，除非字符串就是 "0"，否则返回的字符串中不能含有前导零。

/**
 * @param {number} n
 * @return {string}
 */
var baseNeg2 = function (n) {
  if (n === 0) return "0";
  let res = "";
  while (n) {
    if (Math.abs(n % 2) === 1) {
      // 奇数
      res = "1" + res;
      n--;
    } else {
      res = "0" + res;
    }
    n = n / -2;
  }
  return res;
};

// 0  => 0
// 1  =>  1     0 - 1
// 10 => -2
// 11 => -1     -1 - -2
// 100 => 4
// 101 => 5
// 110 => 2
// 111 => 3     2 - 5
// 1000 => -8
// 1001 => -7
// 1010 => -10
// 1011 => -9
// 1100 => -4
// 1101 => -3
// 1110 => -6
// 1111 => -5
// 10000 => 16
// 10001 => 17
// 10010 => 14
//

// "11100000111"
