/*
 * @Author: mangwu                                                             *
 * @File: main.js                                                              *
 * @Date: 2022-11-07 10:17:32                                                  *
 * @LastModifiedDate: 2022-11-08 09:28:10                                      *
 * @ModifiedBy: mangwu                                                         *
 * -----------------------                                                     *
 * Copyright (c) 2022 mangwu                                                   *
 * -----------------------                                                     *
 * @HISTORY:                                                                   *
 * Date   	            By 	    Comments                                       *
 * ---------------------	--------	----------------------------------------------- *
 */

// 给你一个 m x n 的整数矩阵 grid 。

// 菱形和 指的是 grid 中一个正菱形 边界 上的元素之和。
// 本题中的菱形必须为正方形旋转45度，且四个角都在一个格子当中。
// 下图是四个可行的菱形，每个菱形和应该包含的格子都用了相应颜色标注在图中。

/**
 * @param {number[][]} grid
 * @return {number[]}
 */
var getBiggestThree = function (grid) {
  // 四个角落的值单独计算
  const m = grid.length;
  const n = grid[0].length;

};

// 100  => 1 + 2 + 3 +...+

// 8 => 1 + 2 + 3 + 3 + 2 + 1
//   => 1 + 2 + 3 + 3 + 2 + 1
//   => 1 + 2 + 2 + 2 + 2 + 1
//   => 1 + 2 + 2 + 2 + 2 + 1
//   => 1 + 1 + 1 + 1 + 1 + 1
//   => 1 + 1 + 1 + 1 + 1 + 1

// 9 => 1 + 2 + 3 + 4 + 3 + 2 + 1
//   => 1 + 2 + 3 + 
